def z1():
    slovar1 = {"Австрия": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон", "Германия": "Берлин", "Ирландия": "Дублин", "Лихтенштейн": "Вадуц", "Нидерладны": "Амстердам",
                 "Франция": "Париж", "Белоруссия": "Минск", "Болгария": "София", "Польша": "Варшава", "Чехия": "Прага", "Албания": "Тирана", "Босния и Герцеговина": "Сараево", "Северная Македония": "Скопье", "Сербия": "Белград"}
    for i in slovar1:
        print(i, "-", slovar1[i])
    country = input("введите страну")
    if country in slovar1:
        print(slovar1[country])
    for i in sorted(slovar1):
        print(i)
def z2():
    slovar2 = {
    "а": 1,
    "б": 3,
    "в": 1,
    "г": 3,
    "д": 2,
    "е": 1,
    "ё": 3,
    "ж": 5,
    "з": 5,
    "и": 1,
    "й": 4,
    "к": 2,
    "л": 2,
    "м": 2,
    "н": 1,
    "о": 1,
    "п": 2,
    "р": 1,
    "с": 1,
    "т": 1,
    "у": 2,
    "ф": 10,
    "х": 5,
    "ц": 5,
    "ч": 5,
    "ш": 8,
    "щ": 10,
    "ъ": 10,
    "ы": 4,
    "ь": 3,
    "э": 8,
    "ю": 8,
    "я": 3
}
    cnt = 0
    word = input("введите слово")

    for i in word:
        if i in slovar2:
            cnt += slovar2[i.lower()]
    print(cnt)

def z3():
    sidorov = ["русский", "китайский", "французский"]
    ivanov = ["немецкий", "русский"]
    petrov = ["китайский", "французский", "русский"]
    smirnov = ["немецкий", "русский", "китайский", "французский"]
    o = sidorov + ivanov + petrov + smirnov
    o = set(o)
    o = list(o)
    o = sorted(o)
    s = []
    for i in sidorov:
        if i == "китайский":
            s.append("sidorov")
    for i in ivanov:
        if i in "китайский":
            s.append("ivanov")
    for i in petrov:
        if i in "китайский":
            s.append("petrov")
    for i in smirnov:
        if i in "китайский":
            s.append("smirnov")
    print(*o, "-", "кол-во языков: ", len(o))
    print("знают китайский:", *s)



#z1()
#z2()
z3()